#я хочу сделать игру типа дино гугл хром но я не знаю как создадтм дино и кактус , а там решим!!!!
from time import *
from random import *
o = 3;
k = True;
def hil():
    print('''
    ----------------
    #####   #####
    #############
    #############
     ###########
       #######
         ###
          #
    ---------------
    ''')
def dino():
	print('''
    ------------------
    #########
    #########
    ######o##
    #######==
    #########
    ####
    ###########
##  #######
###########
    #######
    #######
    ##  ###
    ##  ###
    -------------------
    ''')
def Up():
	print('''
    ------------------
    #########
    #########
    ######o##
    #######==
    #########
    ####
    ###########
    #######
##  #######
  #########
    #######
    ##  ###
    ##  ###
    ///////////////////
    ////////////////////
    //////////////////
    ///////////////////
    -------------------
    ''')
def dinoDown():
	print('''
    ------------------
    #########
    #########
    ######o##
    #######==
    #########
    #####
    #######
  # ######
  ########
  ########
  ##   ###
   -------------------
    ''')
#def это создание функции. Она не отоброжается в начале но если мы её вызовим она появится!!!
dino()
def kaktus():
	print('''
    -------------
    ##  #####  ##
    ##  #####  ##
    ##  #####  ##
    #############
    #############
    #############
    #############
       ########
       ########
       ########
    -------------
	''')
#это кактус из хэчстэгов
def kaktus2():
	print('''
    ----------------------
    ##  ####   ##
    ##  ####   ##
    ##  ####   ##
    #############
    #############
    #############
    ############# # ## #
    ############# ######
    #############  ####
        ####       ####
        ####       ####
    ---------------------
	''')
def upr():
	print('''
    ----------------------
    8 = прыгнуть,
    2 = пресесть,
    g = закончить игру,
    l = подхилится,
    r = управление.
    ----------------------
	''')
sleep(1)
upr()
while k:
    h = input('действие: ')
    if h == '2':
        dinoDown()
        l = randint(1,5)
        if l == 2:
            kaktus2()
            o -= 2
        if l == 3:
            kaktus()
            o -= 1
    if h == '8':
        Up()
        l = randint(1,5)
        if l == 2:
            kaktus2()
            o -= 2
        if l == 3:
            kaktus()
    if h == 'l':
        hil()
        l = randint(1,5)
        uyt = randint(1,5)
        if l == 2:
            o += 1
        if l == 3:
            o += 2
        if uyt == 2:
            kaktus2()
        if uyt == 3:
            kaktus()
    if h == 'r':
        upr()
        l = randint(1,5)
        if l == 2:
            kaktus2()
            o -= 2
        if l == 3:
            kaktus()
            o -= 1
        print(o)
    if o == 0:
        print('Game over')
        k = False
        break
    if h == 'g':
        print('игра окончена')
        k = False
        break
    if h == 'dino34':
        o += 4
    if h == 'dino2022':
        o += 10
